# dashboard/permissions.py
from django.utils.translation import gettext_lazy as _

PERMISSION_GROUPS = {
    'المنتجات': {
        'product': {
            'add': _('إضافة منتج'),
            'change': _('تعديل منتج'),
            'delete': _('حذف منتج'),
            'view': _('عرض المنتجات'),
        },
        'category': {
            'add': _('إضافة تصنيف'),
            'change': _('تعديل تصنيف'),
            'delete': _('حذف تصنيف'),
            'view': _('عرض التصنيفات'),
        },
        'brand': {
            'add': _('إضافة علامة تجارية'),
            'change': _('تعديل علامة تجارية'),
            'delete': _('حذف علامة تجارية'),
            'view': _('عرض العلامات التجارية'),
        },
    },
    'الطلبات': {
        'order': {
            'add': _('إضافة طلب'),
            'change': _('تعديل طلب'),
            'delete': _('حذف طلب'),
            'view': _('عرض الطلبات'),
        },
    },
    'عمليات الدفع': {
        'paymentmethod': {  # إضافة طرق الدفع
            'add': _('إضافة طريقة دفع'),
            'change': _('تعديل طريقة دفع'),
            'delete': _('حذف طريقة دفع'),
            'view': _('عرض طرق الدفع'),
        },
    },
    'المستخدمين': {
        'user': {
            'add': _('إضافة مستخدم'),
            'change': _('تعديل مستخدم'),
            'delete': _('حذف مستخدم'),
            'view': _('عرض المستخدمين'),
        },
        'role': {
            'add': _('إضافة دور'),
            'change': _('تعديل دور'),
            'delete': _('حذف دور'),
            'view': _('عرض الأدوار'),
        },
    },
    'الإعدادات': {
        'sitesettings': {  # إعدادات الموقع
            'change': _('تعديل إعدادات الموقع'),
        },
        'newsletter': {  # النشرة البريدية
            'add': _('إضافة اشتراك جديد'),
            'change': _('تعديل اشتراك'),
            'delete': _('حذف اشتراك'),
            'view': _('عرض اشتراكات النشرة البريدية'),
        },
        'slideritem': {  # عناصر السلايدر
            'add': _('إضافة عنصر سلايدر جديد'),
            'change': _('تعديل عنصر سلايدر'),
            'delete': _('حذف عنصر سلايدر'),
            'view': _('عرض عناصر السلايدر'),
        },
    },

    # إضافة قسم جديد للفعاليات
    'الفعاليات': {
        'event': {
            'add': _('إضافة فعالية جديدة'),
            'change': _('تعديل فعالية'),
            'delete': _('حذف فعالية'),
            'view': _('عرض الفعاليات'),
        },
        'eventimage': {
            'add': _('إضافة صورة للفعالية'),
            'change': _('تعديل صورة الفعالية'),
            'delete': _('حذف صورة الفعالية'),
            'view': _('عرض صور الفعاليات'),
        },
    },
    # إضافة قسم جديد للوحة التحكم
    'لوحة التحكم': {
        'dashboard': {
            'access': _('الوصول إلى لوحة التحكم'),
        },
    },
}